app/controllers/books_controller.rb

INSERT INTO "books" ("author", "bookDescription", "bookTitle", "category", "created_at", "dueDate", "isbn", "lateFee", "onHold", "overDue", "signOutDate", "updated_at", "userName") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "bookDescription" = 'jsfjsbbhj ', "isbn" = 8745638348, "userName" = '', "onHold" = 'f', "overDue" = 'f', "signOutDate" = '2013-04-08', "dueDate" = '2013-04-08', "updated_at" = '2013-04-08 21:58:57.813064' WHERE "books"."id" = 7
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
UPDATE "books" SET "userName" = '', "updated_at" = '2013-04-09 03:40:06.496084' WHERE "books"."id" = 19
---
  def destroy
    @book = Book.find(params[:id])

    if current_user.email == "admin@cloud.com"
      @book.destroy
    else
      @book.userName = ''
      @book.save