app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_hash", "password_salt", "updated_at", "usertype") VALUES (?, ?, ?, ?, ?, ?)
---
def create
  @user = User.new(params[:user])
  if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
def destroy
    @users= User.find(params[:id])
      @users.destroy